tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "sst/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# Terminal graphics for the 21st century
brew "chafa"
# Suite of command-line tools for working with CSV
brew "csvkit"
# Modern, maintained replacement for ls
brew "eza"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# High-velocity, monorepo-scale workflow for Git
brew "git-branchless"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Fast CSV toolkit written in Rust
brew "xsv"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Chromium based browser
cask "arc"
# Colemak mod for more comfortable typing (DH variant)
cask "colemak-dh"
cask "font-geist-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty@tip"
# Utility to hide menu bar items
cask "hiddenbar"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Control your tools with a few keystrokes
cask "raycast"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Gecko based web browser
cask "zen"
